data/outputs/go/test1.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        
Server Hostname:        192.168.1.133
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.356 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      408000 bytes
HTML transferred:       223000 bytes
Requests per second:    298.00 [#/sec] (mean)
Time per request:       167.784 [ms] (mean)
Time per request:       3.356 [ms] (mean, across all concurrent requests)
Transfer rate:          118.74 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   5.8      0      31
Processing:     0  160  28.3    162     218
Waiting:        0   88  50.1     87     199
Total:          0  163  28.4    165     222

Percentage of the requests served within a certain time (ms)
  50%    165
  66%    172
  75%    178
  80%    184
  90%    195
  95%    200
  98%    204
  99%    208
 100%    222 (longest request)