data/outputs/go/test2.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        
Server Hostname:        192.168.1.133
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.429 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      408000 bytes
HTML transferred:       223000 bytes
Requests per second:    291.62 [#/sec] (mean)
Time per request:       171.453 [ms] (mean)
Time per request:       3.429 [ms] (mean, across all concurrent requests)
Transfer rate:          116.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   6.0      0      38
Processing:     0  163  30.0    168     215
Waiting:        0   93  50.2     94     208
Total:          0  166  30.2    172     216

Percentage of the requests served within a certain time (ms)
  50%    172
  66%    180
  75%    185
  80%    187
  90%    198
  95%    202
  98%    208
  99%    212
 100%    216 (longest request)