data/outputs/go/test3.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        
Server Hostname:        192.168.1.133
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.344 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      408000 bytes
HTML transferred:       223000 bytes
Requests per second:    299.04 [#/sec] (mean)
Time per request:       167.204 [ms] (mean)
Time per request:       3.344 [ms] (mean, across all concurrent requests)
Transfer rate:          119.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   6.1      0      36
Processing:    16  160  28.3    161     224
Waiting:        0   99  46.6     95     206
Total:         16  163  28.4    164     227

Percentage of the requests served within a certain time (ms)
  50%    164
  66%    172
  75%    176
  80%    178
  90%    188
  95%    201
  98%    216
  99%    221
 100%    227 (longest request)