data/outputs/go/test4.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        
Server Hostname:        192.168.1.133
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   4.893 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      408000 bytes
HTML transferred:       223000 bytes
Requests per second:    204.37 [#/sec] (mean)
Time per request:       244.649 [ms] (mean)
Time per request:       4.893 [ms] (mean, across all concurrent requests)
Transfer rate:          81.43 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5  13.3      0     141
Processing:     0  236 115.5    187     664
Waiting:        0  129  96.5    109     472
Total:         16  240 117.2    190     664

Percentage of the requests served within a certain time (ms)
  50%    190
  66%    248
  75%    295
  80%    327
  90%    427
  95%    472
  98%    534
  99%    648
 100%    664 (longest request)