data/outputs/go/test6.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        
Server Hostname:        192.168.1.133
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.650 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      408000 bytes
HTML transferred:       223000 bytes
Requests per second:    274.01 [#/sec] (mean)
Time per request:       182.478 [ms] (mean)
Time per request:       3.650 [ms] (mean, across all concurrent requests)
Transfer rate:          109.17 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   6.1      0      31
Processing:     5  175  34.0    173     257
Waiting:        0  103  54.2     98     243
Total:         11  178  34.3    178     266

Percentage of the requests served within a certain time (ms)
  50%    178
  66%    193
  75%    200
  80%    204
  90%    220
  95%    234
  98%    242
  99%    250
 100%    266 (longest request)