data/outputs/go/test9.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        
Server Hostname:        192.168.1.133
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   4.335 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      408000 bytes
HTML transferred:       223000 bytes
Requests per second:    230.67 [#/sec] (mean)
Time per request:       216.760 [ms] (mean)
Time per request:       4.335 [ms] (mean, across all concurrent requests)
Transfer rate:          91.91 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  32.6      0    1018
Processing:     0  209 222.8    159    1212
Waiting:        0   90 115.4     78    1212
Total:         16  213 225.0    162    1212

Percentage of the requests served within a certain time (ms)
  50%    162
  66%    171
  75%    175
  80%    178
  90%    194
  95%   1165
  98%   1195
  99%   1196
 100%   1212 (longest request)